ambrop72/aprinter/aprinter/printer/aprinter-stm32f4.cpp
#if 0
AMBRO_AT91SAM3X_CLOCK_TC0_GLOBAL(p.myclock, MyContext())
AMBRO_AT91SAM3X_CLOCK_TC1_GLOBAL(p.myclock, MyContext())
AMBRO_AT91SAM3X_CLOCK_TC2_GLOBAL(p.myclock, MyContext())
AMBRO_AT91SAM3X_CLOCK_TC3_GLOBAL(p.myclock, MyContext())
AMBRO_AT91SAM3X_CLOCK_TC4_GLOBAL(p.myclock, MyContext())
AMBRO_AT91SAM3X_CLOCK_TC5_GLOBAL(p.myclock, MyContext())
AMBRO_AT91SAM3X_CLOCK_TC6_GLOBAL(p.myclock, MyContext())
AMBRO_AT91SAM3X_CLOCK_TC7_GLOBAL(p.myclock, MyContext())
AMBRO_AT91SAM3X_CLOCK_TC8_GLOBAL(p.myclock, MyContext())

AMBRO_AT91SAM3X_CLOCK_INTERRUPT_TIMER_TC0A_GLOBAL(*p.myprinter.getEventChannelTimer(), MyContext())
AMBRO_AT91SAM3X_CLOCK_INTERRUPT_TIMER_TC1A_GLOBAL(*p.myprinter.getAxisStepper<0>()->getTimer(), MyContext())
AMBRO_AT91SAM3X_CLOCK_INTERRUPT_TIMER_TC2A_GLOBAL(*p.myprinter.getAxisStepper<1>()->getTimer(), MyContext())
AMBRO_AT91SAM3X_CLOCK_INTERRUPT_TIMER_TC3A_GLOBAL(*p.myprinter.getAxisStepper<2>()->getTimer(), MyContext())
AMBRO_AT91SAM3X_CLOCK_INTERRUPT_TIMER_TC4A_GLOBAL(*p.myprinter.getAxisStepper<3>()->getTimer(), MyContext())
AMBRO_AT91SAM3X_CLOCK_INTERRUPT_TIMER_TC8A_GLOBAL(*p.myprinter.getAxisStepper<4>()->getTimer(), MyContext())
AMBRO_AT91SAM3X_CLOCK_INTERRUPT_TIMER_TC5A_GLOBAL(*p.myprinter.getHeaterTimer<0>(), MyContext())
AMBRO_AT91SAM3X_CLOCK_INTERRUPT_TIMER_TC5B_GLOBAL(*p.myprinter.getHeaterTimer<1>(), MyContext())
AMBRO_AT91SAM3X_CLOCK_INTERRUPT_TIMER_TC6A_GLOBAL(*p.myprinter.getHeaterTimer<2>(), MyContext())
AMBRO_AT91SAM3X_CLOCK_INTERRUPT_TIMER_TC6B_GLOBAL(*p.myprinter.getFanTimer<0>(), MyContext())
AMBRO_AT91SAM3X_CLOCK_INTERRUPT_TIMER_TC7A_GLOBAL(*p.myprinter.getFanTimer<1>(), MyContext())

#ifndef USB_SERIAL
AMBRO_AT91SAM3X_SERIAL_GLOBAL(*p.myprinter.getSerial(), MyContext())
#endif
AMBRO_AT91SAM3X_SPI_GLOBAL(*p.myprinter.getSdCard()->getSpi(), MyContext())
AMBRO_AT91SAM3X_ADC_GLOBAL(p.myadc, MyContext())
#endif

AMBRO_STM32F4_USB_GLOBAL(MyUsb, MyContext())

static void emergency (void)
{
//    MyPrinter::emergency();
}

MyLoop::QueuedEvent timer;
uint32_t next;

uint32_t const Ticks = 0.002 * MyClock::time_freq;

static void timer_handler (MyLoop::QueuedEvent *, MyContext c)
{
    typename MyUsb::State st = MyUsb::getState(c);
    MyPins::template set<DiscoveryPinLedGreen>(c, st == MyUsb::STATE_WAITING_RESET);
    MyPins::template set<DiscoveryPinLedOrange>(c, st == MyUsb::STATE_WAITING_ENUM);
    MyPins::template set<DiscoveryPinLedRed>(c, st == MyUsb::STATE_ENUM_DONE);
    MyPins::template set<DiscoveryPinLedBlue>(c, st == MyUsb::STATE_TEST);
    
    next += Ticks;
    timer.appendAt(c, next);
}

int main ()
{
    platform_init();
    
    MyContext c;
    
    MyDebugObjectGroup::init(c);
    MyClock::init(c);
    MyLoop::init(c);
    MyPins::init(c);
    //MyAdc::init(c);
    //MyPrinter::init(c);
    MyUsb::init(c);
    
    MyPins::template setAlternateFunction<Stm32f4Pin<Stm32f4PortA, 8>, 10>(c);
    MyPins::template setAlternateFunction<Stm32f4Pin<Stm32f4PortA, 10>, 10>(c);
    MyPins::template setAlternateFunction<Stm32f4Pin<Stm32f4PortA, 11>, 10>(c);
    MyPins::template setAlternateFunction<Stm32f4Pin<Stm32f4PortA, 12>, 10>(c);
    
    MyPins::template set<DiscoveryPinLedGreen>(c, 0);
    MyPins::template set<DiscoveryPinLedOrange>(c, 0);
    MyPins::template set<DiscoveryPinLedRed>(c, 0);
    MyPins::template set<DiscoveryPinLedBlue>(c, 0);
    
    MyPins::template setOutput<DiscoveryPinLedGreen>(c);
    MyPins::template setOutput<DiscoveryPinLedOrange>(c);
    MyPins::template setOutput<DiscoveryPinLedRed>(c);
    MyPins::template setOutput<DiscoveryPinLedBlue>(c);
    
    timer.init(c, timer_handler);
    next = MyClock::getTime(c);
    timer.appendAt(c, next);
    
    MyLoop::run(c);
}
